# name = "Иван" #строка (string)
# name = input("Как тебя зовут? ")
# age = 23 #int
# age = int(input("Сколько тебе лет? "))
# suc = True #bool
# num = 45.6
# float - вещ число, число с точкой
# print(f"=====Калькулятор для {name}=====")
# a, b, op = float(input("Введи 1-ое число ")), 
#   float(input("Введи 2-ое число ")), 
#   input(
#     "[*] - умножить \n",
#     "[-] - вычитание \n", 
#     "[+] - сложение \n",
#     "[/] - деление \n", 
#     "Какую операцию ты хочешь сделать?")
# print("Результат подсчёта:", eval(f"{a}{op}{b}"))

# print("Тебя звать ", name, " ?")
# print(f"Твое имя {name}, тебе {age} года")

# CTRL + S - сохранения файла
# CTRL + Z - шаг назад
# CTRL + A - выделения всего
# End - перемещение курсора в конец строки
# Home - перемещение курсора в начало строки 
# Tab - два пробела 
# Shift + Tab - два пробела в левую сторону
# CTRL + L - открытие поисковика по файлу
# CTRL + D - дублирование строки (на которой стоит курсор)
# CTRL + X - удаление строки (на которой стоит курсор)



# width = int(input("Напиши ширину: "))
# height = int(input("Напиши высоту: "))
# s = width * height

# print(f"Площадь равна: {s}")

a,b = int(input("a ")), int(input("b "))
s = "*"
print("Площадь равна: ", eval(f"{a}{s}{b}"))
